{
    "title": "have fun",
    "intro": "廖梦",
    "description": "我想制作每个人都能玩的游戏",
    "menu": {
        "star-game": {
            "title": "Star Game",
            "description": "独立开发网页游戏"
        },
        "dreams-of-fuyao": {
            "title": "扶摇一梦",
            "description": "主文案，MMORPG"
        },
        "the-well": {
            "title": "The WELL",
            "description": "英文科幻短篇"
        },
        "twin-embroidery": {
            "title": "双绣",
            "description": "完结漫画"
        },
        "glorious-girl-band": {
            "title": "盛世女团",
            "description": "完结漫画"
        },
        "letter-in-the-night-rain": {
            "title": "夜雨寄北",
            "description": "完结漫画"
        },
        "xiu-xian": {
            "title": "人生在世，修仙二字",
            "description": "幻想轻小说"
        },
        "more-samples": {
            "title": "更多文风参考",
            "description": "中文，2018年前完成"
        },
        "about": {
            "title": "关于我",
            "description": "经历&联系方式"
        }
    },
    "sections": {
        "star-game": {
            "title": "概述",
            "overview": "虽然是一个只有三幕的迷你游戏，但作为我的第一个独立游戏开发项目，它对我而言意义重大。在三周内，我自学了各种工具——从游戏引擎（GMS、Godot）到人工智能助手（Cursor、Midjourney、Stable Diffusion）以及版本控制（GitHub）。\n\n这个游戏讲一个孤独的女孩用弹弓打下星星，然后用轨道圈住它们来陪伴自己，直到创造出整个宇宙——却依然孤独。",
            "conceptArt": "我用 Midjourney 生成了这张初始概念图，灵感来自梵高的星空。然后再通过 Stable Diffusion 转换成像素风格，用在游戏的最后一幕。",
            "development": "虽然有Cursor的帮助，但最难的依然是开发过程。难的当然不是功能实现，而是Debug，我现在已经开始学python了。目标不是成为专业程序员，而是理解代码构建规则。"
        },
        "dreams-of-fuyao": {
            "title": "说明",
            "teaser": "这是《扶摇一梦》的官方预告片。\n\n游戏聚焦于女性觉醒，剧情主要通过女主视角展开。\n\n预告片重点展现了几层冲突：看似繁荣的朝代和其中潜藏的危机；女主追求和社会期望的背离；以及女主个人的内心挣扎。\n\n这些冲突彼此交织，形成故事的主线。\n\n最终构建悬念，引发玩家好奇——主角要如何面对和解决这些冲突。",
            "opening": "作为主叙事设计师和视觉总监，我指导了这段开场动画，目的是让玩家沉浸在《浮妖之梦》的世界中。\n\n在视觉上，我们将传统水墨画与描金技法相结合，象征着古典背景（封建王朝）与现代主题（女性觉醒）的融合。我们与动画师密切合作，精心制作了几个意味深长的镜头——比如在叙述端大人在民众支持下崛起时，镜头从他的脚下降至遍布尸骸的战场，创造出与叙事形成对比的视觉效果，引导玩家思考故事更深层的含义。\n\n在叙事上，这段动画通过介绍世界观和初始冲突搭建了舞台：我们的主角将如何面对书院的没落？它还巧妙地编织进了华词静的故事——她不仅是过去的人物，更是一个与主角历程相似的角色，共同体现了女性觉醒这一核心探索。",
            "character": "这是华词静的角色预告片——她是一个关键的对手角色，她的旅程与主角的交织在一起，就像镜中的两个倒影，一个在内，一个在外。\n\n华词静的故事源自一个由来已久的文学传统，比如清代的《再生缘》，讲述才女们虽然得以掌权却不可避免地面临束缚。为了反映这种呼应并突出她角色的独特性，我选择融入戏曲元素而非常规的独白。\n\n与她的文学前辈不同，华词静以对命运的顽强抗争打破了模式。她与主角的冲突代表了面对共同困境的两种对立方式：激进的颠覆与温和的改良。她们平行的旅程——一个拆毁体制，一个努力修补——为叙事增添了深度，将个人悲剧转化为关于权力、理想主义以及女性在定义自己道路时所面临选择的更宏大寓言。"
        },
        "the-well": {
            "afterword": "这个故事对我来说具有特殊意义，不仅因为这是我第一次尝试用英语写作，更是一次自我发现之旅。多年来，我在商业写作方面表现出色——分析市场、受众需求和项目要求。然而当我终于放下所有商业考虑，探索自己的内心时，我发现那里一直有一口井。\n\n在中国农村，井承载着古老的神秘。每个村子似乎都流传着关于女性在绝望时刻跳入井中的故事，她们的灵魂在下面黑暗的水中徘徊。\n\n小时候，这些故事让我害怕井。它们似乎体现了生活中的困扰——就像从井中打水一样，每次试图解决一个问题都会在深处发现更多问题。但多年后，我遇到一个关于非洲村庄妇女的故事，改变了我的看法。尽管非政府组织在她们的社区安装了现代供水系统，许多妇女仍然选择去井边。那里是她们的庇护所，是唯一能够暂时离开家庭、做回自己的地方。\n\n这个发现转变了我的理解。我曾经认为是无尽痛苦之源的东西，实际上是慰藉的源泉——对大多数女性来说，世界本身才常常是痛苦的根源。\n\n我创作这个故事是因为女性似乎总在寻找属于自己的井，因为外面的世界属于男人。正如西蒙·德·波伏娃在《第二性》中观察到的：\"男人最美妙的地方——在青春期和成年期——在于他不是命中注定的；'命运'这个词对男孩和女孩有着不同的共鸣。男孩越是成长发展，就越是向世界敞开冒险之旅，越是被召唤去超越自我。与此同时，女孩会发现世界是有限的，她会学到自己注定属于男人，她梦想的不是超越自我，而是寻找幸福。\""
        },
        "twin-embroidery": {
            "note": "在所有中国城市中，苏州在我心中占据着特殊的位置，因为它最能体现传统古典之美。\n\n开始数字游民之旅后，我计划在苏州待上一年，从这座城市寻找灵感。这个决定最终促成了《双绣》的创作，这部作品以苏州双面绣艺术为核心。\n\n这门古老而非凡的工艺允许匠人使用极其精细的丝线，在一块丝绸的两面创作出两幅截然不同却同样精致的图案。这种技法完美映射了我故事的主题：一个看似坚强的女性无法逃脱过去的阴影。她最初学习双面绣，希望能在伤痕累累的过去之上缝制出一个新的自我。\n\n然而，就像绣品的两面一样，她逐渐明白，她的力量和伤痕都是她本质的一部分。通过爱与艺术，她最终学会了拥抱完整的自己。"
        },
        "glorious-girl-band": {
            "note": "《光荣少女乐队》是我的第一部连载漫画，源于一个简单却大胆的想法：古代中国的一支才女摇滚乐队。\n\n故事设定在一个摆脱了传统束缚的理想化历史世界，讲述七个天赋独特的女孩聚在一起，组成一支非传统的、充满奇妙混乱的乐队。她们的冒险将中国传统与摇滚音乐的原始能量交织在一起，创造出全新而意想不到的事物。\n\n这不是一个关于压迫或挣扎的故事——而是对创造力、友谊和一起制作音乐的纯粹快乐的颂扬。虽然这样的自由可能只存在于这个幻想世界中，但正是因为这样，我才想让这些角色在她们想象中的舞台上尽情绽放光芒。\n\n她们向世界咆哮着歌声——不是绝望的呐喊，而是一种力量，有时比悲伤更能让我落泪。"
        },
        "letter-in-the-night-rain": {
            "note": "《雨夜来信》的灵感来自李商隐的同名唐诗：",
            "poem": {
                "original": "君问归期未有期， 巴山夜雨涨秋池。\n何当共剪西窗烛， 却话巴山夜雨时。",
                "translation": "你问我何时归来，我却无法给出答案，\n巴山夜雨中，秋池水位渐涨。\n何时才能再次在西窗下一起剪烛，\n谈论这巴山夜雨时？"
            },
            "description": "这部漫画将诗中的思念与忧伤扩展成一部设定在古代中国的政治剧。每一章都以一封雨夜书信的节选开篇，既作为章节概要，也作为主题框架。故事是这样开始的：",
            "letter": {
                "original": "凌弟台鉴，寒灯夜雨，怀人倍切。愚兄凭窗而叹，忆及明成十年与弟京郊初晤，竟恍然如昨。",
                "translation": "亲爱的凌弟，在这个雨夜，寒灯下我对你的思念愈发深切。倚窗叹息时，回想起明成十年间在京郊与你初次相遇，恍如昨日..."
            },
            "conclusion": "这种嵌套的叙事结构让信件随时间逐渐展开，每一个精心选择的词句都揭示出两个密友渐行渐远时的关键时刻。\n\n从本质上说，这是一个关于知己的故事——两个志同道合的朋友最终因为不同的政治理想而分道扬镳。在他们都实现了自己的抱负之后，其中一人写下这封信，试图挽救他们的友谊，却不知这将成为他的遗言。"
        },
        "more-samples": {
            "title": "日式轻小说",
            "overview": "这里收录了我2018年以前的一些中文作品，包括短篇小说、散文和诗歌。",
            "note": "这些早期作品记录了我作为作家的成长历程，虽然可能还不够成熟，但都承载着真挚的情感和思考。"
        },
        "about": {
            "experience": {
                "title": "工作经历",
                "items": [
                    {
                        "year": "2021-2024",
                        "title": "三七游戏 | 主文案",
                        "project": "扶摇一梦，MMORPG"
                    },
                    {
                        "year": "2016-2020",
                        "title": "全职作者 | 漫画脚本，小说"
                    }
                ]
            },
            "contact": {
                "title": "联系方式",
                "email": "luisemeng1994@gmail.com",
                "phone": "+86 182-7091-7675",
                "social": "@luisemeng.bsky.social"
            }
        },
        "xiu-xian": {
            "title": "修仙二字，一生修行",
            "overview": "夏凡拜进云莱宗之后，终于听师兄们谈论起关于二字修真法诀的奥秘。 据说那是足以让所有修士疯狂的至高机缘——只有真正的天之骄子，才能领悟属于自己的二字真诀。\n\n比如整个云莱宗上下，就只有高洁出尘的大师姐一人得到了这样的机缘。\n\n那么，高洁出尘大师姐的二字真诀是什么？夏凡问。\n\n师兄：杀猪。\n\n非传统修仙设定，在这个世界有一种名为二字修真法诀的特殊机缘，获得机缘的人只要按照法则提示修炼，就能迅速提升修为，最终飞升成仙。每个人的二字真诀各不相同，唯一的共同点是获得的人都把它当作诅咒，因为它让善良的人杀戮，让忠诚的人背叛，让有情的人忘情。\n\n天，难道不会错吗——\n\n用轻小说的形式，讲述一群怀揣着天真理想的少年，如何用血肉之躯对抗命运的焚烧。"
        }
    },
    "common": {
        "scrollDescription": "就像塞尔达！！！",
        "restart": "重新开始",
        "overview": "概述",
        "development": "开发过程",
        "conceptArt": "概念设计",
        "readMore": "继续阅读",
        "watchVideo": "观看视频",
        "loading": "加载中...",
        "backToTop": "返回顶部"
    }
}